<?php
    $gpi_title = "Главная";
    include "_html/head.html";
?>

<div class="container">
    <?php printf("<h2><pre>%-32s %32s</pre></h2>", "=Галанин П. И.=", "=index="); ?>
    <ul>
        <li><a href="/task1">1. Написать cfm.-шаблон, выводящий содержимое каталога WWWRoot.</a></li>
        <li><a href="/task2">2. Написать cfm.-шаблон для создания каталога на диске.</a></li>
        <li><a href="/task3">3. Написать cfm.-шаблон для переименования каталога.</a></li>
        <li><a href="/task6">6. Написать cfm.-шаблон для переименования файла.</a></li>
        <li><a href="/task7">7. Написать cfm.-шаблон для копирования файлов.</a></li>
        <li><a href="/task8">8. Написать cfm.-шаблон для удаления файла.</a></li>
        <li><a href="/task9">9. Написать cfm.-шаблон для считывания содержимого текстового файла. Осуществить вывод
                содержимого считанного файла.</a></li>
    </ul>
</div>
